name: "bert4rec"
platform: "pytorch_libtorch"
max_batch_size : 1
input [
  {
    name: "inputs"
    data_type: TYPE_INT64
    dims: [ 40 ]
  },
  {
    name: "target_idx"
    data_type: TYPE_INT64
    dims: [ 1 ]
  }
]
output [
  {
    name: "output__0"
    data_type: TYPE_INT64
    dims: [ 10 ]
  },
  {
    name: "output__1"
    data_type: TYPE_FP32
    dims: [ 10 ]
  }
]
instance_group [
  {
    count: 2
    kind: KIND_GPU
  }
]
version_policy: { specific: { versions: [ 1 ]}}
