name: "bert4rec"
platform: "pytorch_libtorch"
max_batch_size : 64
input [
  {
    name: "input__0"
    data_type: TYPE_FP32
    dims: [ -1 ]
    reshape { shape: [ 1, -1 ] }
  }
]
output [
  {
    name: "output__0"
    data_type: TYPE_FP32
    dims: [ 1, -1]
    reshape { shape: [ -1 ] }
  },
  {
    name: "output__1"
    data_type: TYPE_FP32
    dims: [ 1, -1]
    reshape { shape: [ -1 ] }
  }
]